IdeaRS.OpenModel.Loading.LoadGroupEC
Load group for EC
This sample shows how to create a load group.
//Creating the model
OpenModel openModel = new OpenModel();
//Load group - needed for Load case
LoadGroupEC loadGroup = new LoadGroupEC();
loadGroup.Name = "LG1";
loadGroup.GammaQ = 1.5;
loadGroup.Psi0 = 0.7;
loadGroup.Psi1 = 0.5;
loadGroup.Psi2 = 0.3;
loadGroup.GammaGInf = 1.0;
loadGroup.GammaGSup = 1.35;
loadGroup.Dzeta = 0.85;
openModel.AddObject(loadGroup);

IdeaRS.OpenModel.Loading.LoadGroupEC.#ctor
Constructor

IdeaRS.OpenModel.Loading.LoadGroupEC.Psi0
ψ 0

IdeaRS.OpenModel.Loading.LoadGroupEC.Psi1
ψ 1

IdeaRS.OpenModel.Loading.LoadGroupEC.Psi2
ψ 2